<h3>Chinook Questions</h3><br>
<b><li>This database includes several tables on invoice information, track, album, artist and genre data, and employee and customer information related to the store's sales. We will use this database and the sqlite3 module in order to explore and answer some questions.</li><b>
<img src="https://docs.yugabyte.com/images/sample-data/chinook/chinook-er-diagram.png" alt="Chinook sample database">

In [1]:
import pandas as pd
import sqlite3 
import os

In [2]:
conn = sqlite3.connect('../input/chinook-music-store-data/chinook.db')
c = conn.cursor()

In [3]:
def sq(q):
    return pd.read_sql_query(q, conn).rename(columns = lambda x:x.replace(' ','_').capitalize())

In [4]:
#Lets show our tables

In [5]:
tables = sq('''select Name,type
               from sqlite_master 
               where type='table' ''')
tables

              Name   Type
0            album  table
1           artist  table
2         customer  table
3         employee  table
4            genre  table
5          invoice  table
6     invoice_line  table
7       media_type  table
8         playlist  table
9   playlist_track  table
10           track  table

In [6]:
album = sq('''select * from album''')
album.head()

   Album_id                                  Title  Artist_id
0         1  For Those About To Rock We Salute You          1
1         2                      Balls to the Wall          2
2         3                      Restless and Wild          2
3         4                      Let There Be Rock          1
4         5                               Big Ones          3

In [7]:
artist = sq('''select * from Artist''')
artist.head()

   Artist_id               Name
0          1              AC/DC
1          2             Accept
2          3          Aerosmith
3          4  Alanis Morissette
4          5    Alice In Chains

In [8]:
customer = sq('''select * from customer''')
customer.head()

,Customer_id,First_name,Last_name,Company,Address,City,State,Country,Postal_code,Phone,Fax,Email,Support_rep_id
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5
2,3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3
3,4,Bjørn,Hansen,None,Ullevålsveien 14,Oslo,None,Norway,0171,+47 22 44 22 22,None,bjorn.hansen@yahoo.no,4
4,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,None,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

In [9]:
employee = sq('''select * from Employee''')
employee.head()

,Employee_id,Last_name,First_name,Title,Reports_to,Birthdate,Hire_date,Address,City,State,Country,Postal_code,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2016-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2016-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2017-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2017-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2017-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [10]:
genre = sq('''select *from Genre''')
genre.head()

   Genre_id                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll

In [11]:
invoice_line = sq('''select * from invoice_line''')
invoice_line.head()

   Invoice_line_id  Invoice_id  Track_id  Unit_price  Quantity
0                1           1      1158        0.99         1
1                2           1      1159        0.99         1
2                3           1      1160        0.99         1
3                4           1      1161        0.99         1
4                5           1      1162        0.99         1

In [12]:
invoice = sq('''select * from Invoice''')
invoice.head()

,Invoice_id,Customer_id,Invoice_date,Billing_address,Billing_city,Billing_state,Billing_country,Billing_postal_code,Total
0,1,18,2017-01-03 00:00:00,627 Broadway,New York,NY,USA,10012-2612,15.84
1,2,30,2017-01-03 00:00:00,230 Elgin Street,Ottawa,ON,Canada,K2P 1L7,9.90
2,3,40,2017-01-05 00:00:00,"8, Rue Hanovre",Paris,None,France,75002,1.98
3,4,18,2017-01-06 00:00:00,627 Broadway,New York,NY,USA,10012-2612,7.92
4,5,27,2017-01-07 00:00:00,1033 N Park Ave,Tucson,AZ,USA,85719,16.83

In [13]:
media_type = sq('''select * from Media_Type''')
media_type.head()

   Media_type_id                         Name
0              1              MPEG audio file
1              2     Protected AAC audio file
2              3  Protected MPEG-4 video file
3              4     Purchased AAC audio file
4              5               AAC audio file

In [14]:
playlist = sq('''select * from Playlist''')
playlist.head()

   Playlist_id        Name
0            1       Music
1            2      Movies
2            3    TV Shows
3            4  Audiobooks
4            5  90’s Music

In [15]:
playlist_track = sq('''select * from Playlist_Track''')
playlist_track.head()

   Playlist_id  Track_id
0            1      3402
1            1      3389
2            1      3390
3            1      3391
4            1      3392

In [16]:
track = sq('''select * from Track''')
track.head()

,Track_id,Name,Album_id,Media_type_id,Genre_id,Composer,Milliseconds,Bytes,Unit_price
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,None,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

### 1-Provide a query showing Customers (just their full names, customer ID and country) who are not in the US.

In [17]:
sq('''select First_name||' '||Last_name as Name, country, customer_id
    from customer 
    where Country <> 'USA' ''').head() #OR (where Country != 'USA')

                    Name         Country  Customer_id
0         Luís Gonçalves          Brazil            1
1          Leonie Köhler         Germany            2
2      François Tremblay          Canada            3
3           Bjørn Hansen          Norway            4
4  František Wichterlová  Czech Republic            5

### 2-Provide a query only showing the Customers from Brazil.

In [18]:
sq('''select customer_id ,first_name||' '||last_name as Name,country 
    from customer
    where country is 'Brazil' ''') #is ---> =

   Customer_id             Name Country
0            1   Luís Gonçalves  Brazil
1           10  Eduardo Martins  Brazil
2           11  Alexandre Rocha  Brazil
3           12  Roberto Almeida  Brazil
4           13   Fernanda Ramos  Brazil

### 3-Provide a query showing the Invoices of customers who are from Brazil. The resultant table should show the customer's full name, Invoice ID, Date of the invoice and billing country.

In [19]:
sq('''select c.customer_id, c.first_name||' '||c.last_name as Name, i.invoice_id, i.invoice_date, i.billing_country
    from customer as c
    join invoice as i on c.customer_id = i.customer_id 
    where country is "Brazil" ''').head()

,Customer_id,Name,Invoice_id,Invoice_date,Billing_country
0,1,Luís Gonçalves,16,2017-01-26 00:00:00,Brazil
1,1,Luís Gonçalves,77,2017-05-28 00:00:00,Brazil
2,1,Luís Gonçalves,149,2017-11-30 00:00:00,Brazil
3,1,Luís Gonçalves,153,2017-12-14 00:00:00,Brazil
4,1,Luís Gonçalves,182,2018-02-07 00:00:00,Brazil

### 4-Provide a query showing only the Employees who are Sales Agents.

In [20]:
sq('''select *
    from employee
    where title like "%Sales%Agent%" ''')

,Employee_id,Last_name,First_name,Title,Reports_to,Birthdate,Hire_date,Address,City,State,Country,Postal_code,Phone,Fax,Email
0,3,Peacock,Jane,Sales Support Agent,2,1973-08-29 00:00:00,2017-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
1,4,Park,Margaret,Sales Support Agent,2,1947-09-19 00:00:00,2017-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
2,5,Johnson,Steve,Sales Support Agent,2,1965-03-03 00:00:00,2017-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

### 4-Provide a query showing a unique list of billing countries from the Invoice table.

In [21]:
sq('''select distinct Billing_country 
    from invoice ''').head() #OR (group by billingcountry)

  Billing_country
0             USA
1          Canada
2          France
3          Poland
4           India

### 5-Provide a query that shows the invoices associated with each sales agent. The resultant table should include the Sales Agent's full name.

In [22]:
sq('''select i.invoice_id ,e.first_name||' '||e.last_name as Name
    from customer as c
    left join invoice as i on i.customer_id = c.customer_id
    left join employee as e on e.employee_id = c.Support_rep_id ''')

     Invoice_id           Name
0            16   Jane Peacock
1            77   Jane Peacock
2           149   Jane Peacock
3           153   Jane Peacock
4           182   Jane Peacock
..          ...            ...
609         324  Steve Johnson
610         335  Steve Johnson
611         351  Steve Johnson
612         407  Steve Johnson
613         527  Steve Johnson

[614 rows x 2 columns]

### 6-Provide a query that shows the Invoice Total, Customer name, Country and Sale Agent name for all invoices and customers.

In [23]:
sq('''select c.first_name||' '||c.last_name as Customer_Name,
             e.first_name||' '||e.last_name as Employee_Name,
             i.Total ,c.country ,e.title
    from customer as c
    left join invoice as i on i.customer_id = c.customer_id 
    left join employee as e on e.employee_id = c.support_rep_id''')

       Customer_name Employee_name  Total Country                Title
0     Luís Gonçalves  Jane Peacock   8.91  Brazil  Sales Support Agent
1     Luís Gonçalves  Jane Peacock   5.94  Brazil  Sales Support Agent
2     Luís Gonçalves  Jane Peacock   8.91  Brazil  Sales Support Agent
3     Luís Gonçalves  Jane Peacock  13.86  Brazil  Sales Support Agent
4     Luís Gonçalves  Jane Peacock   5.94  Brazil  Sales Support Agent
..               ...           ...    ...     ...                  ...
609  Puja Srivastava  Jane Peacock   8.91   India  Sales Support Agent
610  Puja Srivastava  Jane Peacock   8.91   India  Sales Support Agent
611  Puja Srivastava  Jane Peacock   8.91   India  Sales Support Agent
612  Puja Srivastava  Jane Peacock   7.92   India  Sales Support Agent
613  Puja Srivastava  Jane Peacock   4.95   India  Sales Support Agent

[614 rows x 5 columns]

###  7-How many Invoices were there in 2009 and 2011? What are the respective total sales for each of those years?

In [24]:
sq('''select  strftime('%Y',Invoice_Date) as Year, count(*) as invoices_by_year
      from invoice
      group by 1''')#strftime(format, timestring, modifier, modifier, ...)

   Year  Invoices_by_year
0  2017               154
1  2018               151
2  2019               159
3  2020               150

In [25]:
# Using subquery
sq('''select
  (select count(*)
  from invoice i
  where substr(i.invoice_date, 0, 5) = "2009") as Invoices_2009,
  (select count(*)
    from invoice i
    where substr(i.invoice_date, 0, 5) = "2011") as Invoices_2011 ''') #SUBSTR(string, start, length)

   Invoices_2009  Invoices_2011
0              0              0

###  8-Looking at the InvoiceLine table, provide a query that COUNTs the number of line items for Invoice ID 37.

In [26]:
sq('''select count(*) as line_items_ID_37
    from invoice_line
    where Invoice_Id is 37''')

   Line_items_id_37
0                10

### 9-Looking at the InvoiceLine table, provide a query that COUNTs the number of line items for each Invoice.

In [27]:
sq('''select invoice_id ,count(*) as Count
    from invoice 
    group by invoice_id''')

     Invoice_id  Count
0             1      1
1             2      1
2             3      1
3             4      1
4             5      1
..          ...    ...
609         610      1
610         611      1
611         612      1
612         613      1
613         614      1

[614 rows x 2 columns]

### 10-Provide a query that includes the track name with each invoice line item.

In [28]:
sq('''select t.Name as Track_name, i.*
    from  invoice_line as i
    left join track as t on i.track_id=t.track_id 
    ''')

,Track_name,Invoice_line_id,Invoice_id,Track_id,Unit_price,Quantity
0,Right Next Door to Hell,1,1,1158,0.99,1
1,Dust N' Bones,2,1,1159,0.99,1
2,Live and Let Die,3,1,1160,0.99,1
3,Don't Cry (Original),4,1,1161,0.99,1
4,Perfect Crime,5,1,1162,0.99,1
...,...,...,...,...,...,...
4752,Every Breath You Take,4753,614,2659,0.99,1
4753,King Of Pain,4754,614,2660,0.99,1
4754,Wrapped Around Your Finger,4755,614,2661,0.99,1
4755,Don't Stand So Close to Me '86,4756,614,2662,0.99,1
4756,Message in a Bottle (new classic rock mix),4757,614,2663,0.99,1

### 11-Provide a query that includes the purchased track name AND artist name with each invoice line item.

In [29]:
sq('''select  t.name as Track_name ,art.Name as artist ,a.artist_id as Artist_id,il.*
    from invoice_line as il
    left join track as t on t.track_id = il.track_id 
    left join album as a on a.album_id = t.album_id 
    left join artist as art on art.artist_id = a.artist_id
    ''')

,Track_name,Artist,Artist_id,Invoice_line_id,Invoice_id,Track_id,Unit_price,Quantity
0,Right Next Door to Hell,Guns N' Roses,88,1,1,1158,0.99,1
1,Dust N' Bones,Guns N' Roses,88,2,1,1159,0.99,1
2,Live and Let Die,Guns N' Roses,88,3,1,1160,0.99,1
3,Don't Cry (Original),Guns N' Roses,88,4,1,1161,0.99,1
4,Perfect Crime,Guns N' Roses,88,5,1,1162,0.99,1
...,...,...,...,...,...,...,...,...
4752,Every Breath You Take,The Police,141,4753,614,2659,0.99,1
4753,King Of Pain,The Police,141,4754,614,2660,0.99,1
4754,Wrapped Around Your Finger,The Police,141,4755,614,2661,0.99,1
4755,Don't Stand So Close to Me '86,The Police,141,4756,614,2662,0.99,1
4756,Message in a Bottle (new classic rock mix),The Police,141,4757,614,2663,0.99,1

### 12-Provide a query that shows the number of invoices per country.

In [30]:
sq('''select billing_country ,count(*) as invoices_count
    from invoice 
    group by billing_country
    order by 2 desc
    ''').head()

  Billing_country  Invoices_count
0             USA             131
1          Canada              76
2          Brazil              61
3          France              50
4         Germany              41

### 13-Provide a query that shows the total number of tracks in each playlist. The Playlist name should be included on the resultant table.

In [31]:
sq('''select p.Name as Playlist_Name ,count(*) as number_of_tracks
    from playlist_track as pt 
    left join playlist as p on p.playlist_id = pt.playlist_id 
    group by pt.playlist_id
    order by 2 desc''')

                 Playlist_name  Number_of_tracks
0                        Music              3290
1                        Music              3290
2                   90’s Music              1477
3                     TV Shows               213
4                     TV Shows               213
5                    Classical                75
6              Brazilian Music                39
7          Heavy Metal Classic                26
8    Classical 101 - Deep Cuts                25
9   Classical 101 - Next Steps                25
10  Classical 101 - The Basics                25
11                      Grunge                15
12                Music Videos                 1
13                 On-The-Go 1                 1

### 14-Provide a query that shows all the Tracks, but displays no IDs. The resultant table should include the Album name, Media type and Genre.

In [32]:
sq('''select t.Name as Track_name, a.title as Album_title ,m.name ,g.name as Genre
    from track as t 
    left join media_type as m on m.media_type_id = t.media_type_id
    left join genre as g on g.genre_id = t.genre_id
    left join album as a on a.album_id = t.album_id ''').head()

,Track_name,Album_title,Name,Genre
0,For Those About To Rock (We Salute You),For Those About To Rock We Salute You,MPEG audio file,Rock
1,Balls to the Wall,Balls to the Wall,Protected AAC audio file,Rock
2,Fast As a Shark,Restless and Wild,Protected AAC audio file,Rock
3,Restless and Wild,Restless and Wild,Protected AAC audio file,Rock
4,Princess of the Dawn,Restless and Wild,Protected AAC audio file,Rock

### 15-Provide a query that shows all Invoices but includes the number of invoice line items.

In [33]:
sq('''select i.invoice_id ,count(*) as invoice_count
    from invoice as i 
    left join invoice_line as il on il.invoice_id = i.invoice_id
    group by 1''')

     Invoice_id  Invoice_count
0             1             16
1             2             10
2             3              2
3             4              8
4             5             17
..          ...            ...
609         610              7
610         611              2
611         612             12
612         613              9
613         614             13

[614 rows x 2 columns]

### 16-Provide a query that shows total sales made by each sales agent.

In [34]:
sq('''select  e.First_Name || " " || e.last_Name as Name, count(*) as Toltal_Sales
    from employee as e
    left join customer as c on c.Support_Rep_Id  = e.employee_id 
    left join invoice as i on c.Customer_Id = i.Customer_Id
    group by employee_id
    order by 2 desc''')

               Name  Toltal_sales
0     Margaret Park           214
1      Jane Peacock           212
2     Steve Johnson           188
3      Andrew Adams             1
4     Nancy Edwards             1
5  Michael Mitchell             1
6       Robert King             1
7    Laura Callahan             1

###  17-Provide a query that shows the total sales per country. Which country's customers spent the most?

In [35]:
sq('''select i.billing_country ,sum(total) as country_sales
    from invoice as i
    group by billing_country 
    order by 2 desc
    limit 1''')

  Billing_country  Country_sales
0             USA        1040.49

### 18-Which sales agent made the most in sales in 2009?

In [36]:
sq('''select  e.First_Name||' '||e.last_Name as Agent_Name,count(*) as Total_Sales
    from employee as e
    left join customer as c on e.employee_id = c.Support_Rep_Id
    left join invoice as i on i.customer_id = c.customer_id 
    where substr(i.invoice_date ,0,5) = "2009"
    group by e.employee_id
    order by 2''')

Empty DataFrame
Columns: [Agent_name, Total_sales]
Index: []

### 19-Which sales agent made the most in sales in 2010?

In [37]:
sq('''select e.first_name||' '||e.last_name as Employee_name, count(*) as Total_sales
    from employee as e 
    left join customer as c on c.support_rep_id = e.employee_id
    left join invoice as i on i.customer_id = c.customer_id 
    where substr(i.invoice_date ,0,5) = "2010"
    group by e.employee_id
    order by 2 desc''')

Empty DataFrame
Columns: [Employee_name, Total_sales]
Index: []

### 20-Which sales agent made the most in sales over all?

In [38]:
sq('''select e.first_name||' '||e.last_name as Agent_name, count(*) as Total_sales
    from employee as e
    left join customer as c on c.support_rep_id = e.employee_id
    left join invoice as i on c.customer_id = i.customer_id
    group by e.employee_id
    order by 2 desc''')

         Agent_name  Total_sales
0     Margaret Park          214
1      Jane Peacock          212
2     Steve Johnson          188
3      Andrew Adams            1
4     Nancy Edwards            1
5  Michael Mitchell            1
6       Robert King            1
7    Laura Callahan            1

### 21-Provide a query that shows the most purchased track of 2013.

In [39]:
sq('''select t.name as Track_name,count(*) as Track_sales
    from invoice as i
    left join invoice_line as il on il.invoice_id = i.invoice_id
    left join track as t on t.track_id = il.track_id
    where invoice_date in ('2013')
    group by t.track_id
    order by 2 desc''')

Empty DataFrame
Columns: [Track_name, Track_sales]
Index: []

### 22-Provide a query that shows the top 5 most purchased tracks over all.

In [40]:
sq('''select t.name as Track_name ,count(*) as Tack_sales
    from invoice_line as il
    left join track as t on t.track_id = il.track_id
    group by t.track_id
    order by 2 desc ''')

                                 Track_name  Tack_sales
0                                  War Pigs          31
1                             Highway Chile          14
2                      Are You Experienced?          14
3                                   Hey Joe          13
4                  Third Stone From The Sun          13
...                                     ...         ...
1801  Samba De Uma Nota Só (One Note Samba)           1
1802                      Garota De Ipanema           1
1803                             Desafinado           1
1804                   Princess of the Dawn           1
1805                        Fast As a Shark           1

[1806 rows x 2 columns]

### 23-Provide a query that shows the top 3 best selling artists.

In [41]:
sq('''select art.Name as Artist_name ,count(*) as Artist_sales
    from invoice_line as i
    left join track as t on i.track_id = i.track_id
    left join album as a on a.album_id = t.album_id
    left join artist as art on art.artist_id = a.artist_id 
    group by art.artist_id
    order by 2 desc 
    limit 3''')

    Artist_name  Artist_sales
0   Iron Maiden       1013241
1            U2        642195
2  Led Zeppelin        542298